tutorials/uweBourdonTwoViscositiesDoubleHolder/0/DT
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      DT;
    version	2.0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
125000
(
1e-05
1e-05
1e-05
1e-05
1e-05
1e-05
1e-05
1e-05
...
)
;

boundaryField
{
    rightHand
    {
        type            zeroGradient;
    }
    outerRadius
    {
        type            zeroGradient;
    }
    leftHand
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    innerRadius
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
