tutorials/uweBourdonTwoViscositiesDoubleHolder/0/residenceTime
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      residenceTime;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 1 0 0 0 0];

internalField   uniform 1e-5;
//existing boundaries (ignore everything else and set defaultfaces to empty) ['', '    outlet\n', '    defaultName\n', '    Inlet_melt\n', '    Inlet_gas\n']
boundaryField
{
    inlet
    {
        type            fixedValue;
	value		uniform 1e-12;
    }
    innerRadius
    {
        type            zeroGradient;
    }
    outerRadius
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    leftHand
    {
        type            zeroGradient;
    }
    rightHand
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
